| benchmark  | callcc |    chez |        diff | win    | reason            | stalin                                        |
|------------+--------+---------+-------------+--------+-------------------+-----------------------------------------------|
| ack        |   2.00 |    1.97 |         1.5 |        |                   |                                               |
| array1     |   2.56 |    4.88 |     -90.625 |        | MARKLARGE         | .335 with chcks - bounds/typechecks           |
| browse     |    .68 |    1.11 |  -63.235294 |        |                   |                                               |
| bv2string  |        |         |        0./0 | FAIL   |                   |                                               |
| cat        |   1.07 |    1.26 |  -17.757009 |        |                   |                                               |
| chudnovsky |        |         |        0./0 | FAIL   |                   |                                               |
| compiler   |    .67 |   2.284 |  -240.89552 |        |                   |                                               |
| conform    |   1.49 |    1.57 |  -5.3691275 |        |                   |                                               |
| cpstak     |   2.58 |    2.34 |  -14.146341 |        |                   |                                               |
| ctak       |   1.01 |      .5 |   50.495050 | *LOSE* | cont capture??    | .645 0 longjmp                                |
| deriv      |   1.05 |    1.04 |  0.95238095 |        |                   |                                               |
| destruc    |   1.70 |    1.47 |   13.529412 | *LOSE* | types+log is slow |                                               |
| diviter    |   1.11 |    1.12 | -0.90090090 |        |                   |                                               |
| divrec     |   1.66 |    1.82 |  -9.6385542 |        |                   |                                               |
| dynamic    |   1.53 |    1.44 |   5.8823529 | *LOSE* |                   |                                               |
| earley     |   2.12 |   3.151 |  -48.632075 |        |                   |                                               |
| fft        |    .44 |   1.423 |  -223.40909 |        |                   | .211*                                         |
| fibc       |   .467 |     .36 |   22.912206 | *LOSE* | cont capture slow | .32 - just uses longjmp                       |
| fibfp      |    .87 |    2.61 |       -200. |        |                   | .32**                                         |
| fib        |   2.13 |    3.26 |  -53.051643 |        |                   |                                               |
| gcbench    |    .56 |     .61 |  -8.9285714 |        |                   |                                               |
| graphs     |    2.3 |     1.4 |   39.130435 | *LOSE* | inlining          |                                               |
| lattice    |   2.24 |   2.808 |  -25.357143 |        |                   |                                               |
| matrix     |    .68 |   1.124 |  -65.294118 |        |                   |                                               |
| mazefun    |    .85 |   1.783 |  -109.76471 |        |                   |                                               |
| maze       |    .31 |      .6 |  -93.548387 |        |                   |                                               |
| mbrot      |   2.06 |     5.2 |  -152.42718 |        |                   | .385********* type analysis?  fixable         |
| mbrotZ     |        |         |        0./0 | FAIL   |                   |                                               |
| mperm      |   3.95 |    7.36 |  -86.329114 |        |                   |                                               |
| nboyer     |   1.47 |   1.608 |  -9.3877551 |        |                   |                                               |
| nqueens    |   2.79 |   3.751 |  -34.444444 |        |                   | 2.57                                          |
| ntakl      |   1.74 |     2.8 |  -60.919540 |        |                   | 1.5                                           |
| nucleic    |   1.14 |    1.74 |  -52.631579 |        |                   |                                               |
| paraffins  |   1.82 |   4.204 |  -130.98901 |        |                   | 1.2********  GC - larger before collect       |
| parsing    |   1.24 |   2.283 |  -84.112903 |        |                   |                                               |
| peval      |    .94 |    1.58 |  -68.085106 |        |                   |                                               |
| pi         |        |         |        0./0 | FAIL   |                   |                                               |
| pnpoly     |   1.13 |    3.37 |  -198.23009 |        |                   | .687/.83*********     type analysis? fixable  |
| primes     |    .54 |     .73 |  -35.185185 |        |                   | .37  * type analysis- list of ints. fixable   |
| puzzle     |   1.24 |    1.69 |  -36.290323 |        |                   | .587 *********   typetests for int, unfixable |
| quicksort  |   2.32 |    2.51 |  -8.1896552 |        |                   | 1.008********** inlining, bad inexact->exact  |
| ray        |   1.28 |    1.84 |      -43.75 |        |                   |                                               |
| read1      |    .64 |     .57 |   1.7241379 |        | equal/marklarge   |                                               |
| sboyer     |     .6 |     .78 |        -30. |        |                   |                                               |
| scheme     |   1.48 |    2.22 |        -50. |        |                   |                                               |
| simplex    |     .9 |    1.55 |  -72.222222 |        |                   | .180******    simp3 types matrix, fixable     |
| slatex     |   1.72 |    2.16 |  -25.581395 |        |                   |                                               |
| string     |    .33 |    1.61 |  -387.87879 |        |                   |                                               |
| sum1       |    .34 |     .73 |  -114.70588 |        |                   |                                               |
| sumfp      |  1.736 |    3.68 |  -111.98157 |        |                   | .429 */1.24 checks                            |
| sum        |   .680 |    1.64 |  -141.17647 |        |                   |                                               |
| tail       |   2.23 |     2.3 |  -3.1390135 |        |                   |                                               |
| takl       |   1.75 |     2.8 |        -60. |        |                   |                                               |
| tak        |    .99 |    1.25 |  -26.262626 |        |                   |                                               |
| triangl    |    1.1 |     1.2 |  -9.0909091 |        |                   |                                               |
| wc         |    .86 |     .96 |  -11.627907 |        |                   |                                               |
| equal      |    .77 |     .38 |   50.649351 | *LOSE* | marklarge         |                                               |
| total      | 71.273 | 106.429 |  -49.325832 |        |                   |                                               |
#+TBLFM: $4=($2-$3) * 100.0 /$2
#+TBLFM: $5 = '(if (not (= $2 0)) (if (<= $4 5) "" "*LOSE*") "FAIL");N
#+TBLFM: @>$2=vsum(@2..@-1)
#+TBLFM: @>$3=vsum(@2..@-1)
